# shell
brew "pure"
brew "shellcheck"
brew "shfmt"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# tools
brew "fzf"
brew "jq"
brew "htop"

# git
brew "git"
brew "gnupg"

# vim
brew "vim"
brew "vint"
brew "neovim"

# node (needed for coc.nvim)
brew "node"

# font
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

# latex
cask "mactex-no-gui"
cask "skim"
brew "texlab"

# window manager
cask "rectangle"

# terminal
cask "iterm2"

# alfred
cask "alfred"

# hidden bar
cask "hiddenbar"

# development tools
cask "docker"
cask "intellij-idea-ce"
cask "postman"
brew "pyenv"
brew "jenv"
