# shell
brew "pure"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# tools
brew "fzf"
brew "jq"
brew "htop"

# git
brew "git"
brew "gnupg"

# vim
# HEAD installs of neovim do not include treesitter parsers
brew "neovim", args: ["HEAD"]
brew "ripgrep"
brew "vim"

# node
brew "node"

# font
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

# window manager
cask "rectangle"

# terminal
cask "iterm2"

# alfred
cask "alfred"

# hidden bar
cask "hiddenbar"

# development tools
cask "postman"
brew "pyenv"
brew "jenv"
