# shell
brew "pure"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# tools
brew "fzf"
brew "jq"
brew "htop"

# git
brew "git"
brew "gnupg"

# vim
brew "neovim"
brew "ripgrep"
brew "vim"

# node
brew "node"

# font
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

# terminal
cask "iterm2"

# raycast
cask "raycast"

# 1password
cask "1password"
cask "1password-cli"

# development tools
cask "docker"
cask "intellij-idea"
cask "postman"
brew "pyenv"
brew "jenv"
